/*1. Запросите у пользователя число, возведите это число во 2-ю степень и выведите на экран*/

// let number = prompt("Введите число");

// alert(`${number**2}`);

// 2. Запросите у пользователя 2 числа и выведите среднее арифметическое этих чисел.

// let a = +prompt("Введите 1-ое число", '');
// let b = +prompt ("Введите 2-ое число", '');

// alert(`среднее значение = ${(a + b)/2}`);

// 3. Запросите у пользователя длину стороны квадрата и выведите площадь такого квадрата.

// let a = +prompt("Введите длину стороны", '');
// let b = +prompt("Введите ширину стороны", '');

// alert(`площадь квадрата = ${a*b}`);


//4. Реализуйте конвертор из километров в мили (пользователь вводит километры, программа выводит мили). 1 км = 0,621371 миль. Это значение укажите в коде как константу.
// let a = +prompt("Введите км", '');
// const b = 0.621371;

// alert(`В милях будет = ${a*b}`)

// 5.Реализуйте калькулятор. Пользователь вводит два числа, а программа выводит результаты действий + - * / между этими числами.

// let a = +prompt("Введите 1-ое число", '');
// let b = +prompt("Введите 2-ое число", '');

// alert(`при сложение = ${a+b}, при вычитание = ${a-b}, при умножение = ${a*b}, при деление = ${a/b}`);

// 6. Пользователь вводит значения a и b для формулы a * x + b = 0, а программа считает и выводит значение x.

// let a = +prompt("Введите значение a", '');
// let b = +prompt("Введите значение b", '');

// alert('x= ' + -a/b);

// 7. Запросите у пользователя текущее время (часы и минуты) и выведите, сколько часов и минут осталось до следующего дня.

// let a = +prompt("Какое сейчас время (час)", '');
// let b = +prompt("Какое сейчас время (минут)", '');

// alert (`До следующего дня осталось: ${24-a} час ${60-b} минут`)

// 8. Запросите у пользователя трехзначное число и выведите вторую цифру этого числа. Для решения задачи используйте оператор % (остаток от деления).
// let a = +prompt("Введите трехзначное число", '');