/* Задание 1.
Запишите постоянную цену в переменную, которая равна 12 рублям. Создайте пустую переменную action.
Проверьте несколько следующих условий (через тернарный оператор):
	Если стоимость продукта ниже 10 Рублей, то мы решаем купить его.
	В противном случаем двигаемся дальше и смотрим стоит ли выбранный товар менее 20 Рублей.
	Если товар стоит менее 20 Рублей, то требуем увеличить размер скидки!
	В противном случае переходим к следующему условию и проверяем стоит ли наш товар менее 50 Рублей.
	Если стоимость ниже 50 Рублей – то выражаем наше недовольство завышенной ценой – 'Дороговато'.
	Если стоимость оказывается выше 50 Рублей – то отказываемся от покупки товара.
 */


// const price = 52;
// let action;
// action = price<10 ? 'Покупаем' : price<20 ? 'Увеличьте размер скидки' : price<50 ? 'Дороговато' : 'Не будем покупать'
// alert(action)

//Задание 2.
// Перепишите if..else с использованием оператора '?' (тернарный)

// const hungry = true;
// let eat = hungry ? 'Время обеда' : 'Придется работать'
// console.log(eat)